import React from 'react';
import './phytonPage.css';
import photo from '../../photos/coursephoto.svg';
import { useHistory } from 'react-router-dom';



const PhytonPage = () => {
    let history = useHistory();
    const getApply = () => {
        history.push('/apply')
    }
    return (
        <section className='phyton'>
            <h2>Դասընթացի ծրագիր</h2>

            <div>
                <ul>
                    <li>
                        <h4 className='h4-1'> Django-ի հիմունքներ</h4>
                        <p>
                            Այս դասի շրջանակում կուսումնասիրենք Django համակարգը, կհասկանանք, թե ինչ է վիրտուալ միջավայրը,
                            ինչու է այն անհրաժեշտ և ինչպես ստեղծել այն։ Կուսումնասիրենք Django-ի կառուցվածքը։
                        </p>
                    </li>
                    <li>
                        <h4 className='h4-2'> Routing, Requests, server responses</h4>
                        <p>Այս դասի նպատակն է ուսանողին ծանոթացնել ինտերնետ-հասցեների
                            կապակցման համակարգին Django-ում։
                            Սովորեցնել կազմել url-ներ և դրանք կապել սպասարկողի գործառույթների հետ։ Ծանոթացնել HTTP-ի
                            հետ,
                            ինչպես նաև հարցումներ դեպի սերվեր և սերվերից պատասխան։
                        </p>

                    </li>
                    <li>
                        <h4 className='h4-3'>Templates and views</h4>
                        <p>Այս դասի շրջանակում կծանոթանանք Djang-ի ձևանմուշային համակարգի հետ։
                            Կծանոթանանք թեգերի և ֆիլտրերի հետ
                        </p>
                    </li>
                    <li>
                        <h4 className='h4-4'>Models</h4>
                        <p>
                            Կուսումնասիրենք, թե ինչ է մոդելը և ինչու է այն անհրաժեշտ։ Կստեղծենք տվյալների
                            բազային առաջին միգրացիան և կկիրառենք պրակտիկայում։ Կուսումնասիրենք ծրագրերի ադմին-հատվածը և
                            նրա հիմնական ֆունկցիաները։
                        </p>
                    </li>
                    <li>
                        <h4 className='h4-5'>Ֆորմաներ</h4>
                        <p>Կուսումնասիրենք ֆորմաները վեգ-ծրագրավորման մեջ, ֆորմաների ստեղծման սկզբունքները,
                            ինչպես նաև Django-validation և սեփական վալիդացիաների ստեղծում
                        </p>
                    </li>
                    <li>
                        <h4 className='h4-6'>Աշխատանք տվյալների բազայի հետ</h4>
                        <p>Կուսումնասիրենք ORM-ը, օգտագործման սկզբունքները։ Այս դասի շրջանակներում կիմանաք
                            ինչպես ջնջել, ավելացնել, խմբագրել օբյեկտները տվյալների բազայից
                        </p>
                    </li>
                    <li>
                        <h4 className='h4-7'>Օգտատերերի գրանցում և թույլտվություն</h4>
                        <p>Այս դասի շրջանակներում կծանոթանանք կայքում օգտատերեի գրանցման և թույլտվության հետ։
                            Կծանոթանանք հետևյալ հասկացությունների հետ՝ authorization, registration,authentication
                        </p>
                    </li>
                    <li>
                        <h4 className='h4-8'> Ajax </h4>
                        <p>Ինչ է Ajax տեխնոլոգիան, ինպես աշխատել նրա հետ Djang-ում։ Ասինքրոն աշխատանք։ </p>
                    </li>
                    <li>
                        <h4 className='h4-9'>Անվտանգություն</h4>
                        <p>Այս դասի շրջանակում կծանոթանանք վեբ-կայքերի անվտանգության հետ։ </p>
                    </li>
                </ul>
                <div>
                    <h3>Դաընթացի տևողությունը՝ 3 ամիս </h3>
                    <h3>Դասընթացի արժեքը՝ 35,000 ՀՀ դրամ </h3>
                    <button onClick={getApply}>Գրանցվել</button>
                </div>
            </div>
            <div className='course-photo'>
                <img src={photo} align='photo' />
            </div>
        </section>
    )
}

export default PhytonPage;